ARMmbed/mbed-os/targets/TARGET_NUVOTON/TARGET_NUC472/TARGET_NUMAKER_PFM_NUC472/PeripheralPins.c
const PinMap PinMap_UART_RTS[] = {
    {PA_11, UART_0, SYS_GPA_MFPH_PA11MFP_UART0_RTS},
    {PA_15, UART_2, SYS_GPA_MFPH_PA15MFP_UART2_RTS},
    {PB_4, UART_1, SYS_GPB_MFPL_PB4MFP_UART1_RTS},
    {PB_6, UART_4, SYS_GPB_MFPL_PB6MFP_UART4_RTS},
    {PB_9, UART_5, SYS_GPB_MFPH_PB9MFP_UART5_RTS},
    {PB_12, UART_4, SYS_GPB_MFPH_PB12MFP_UART4_RTS},
    {PC_2, UART_4, SYS_GPC_MFPL_PC2MFP_UART4_RTS},
    {PD_6, UART_3, SYS_GPD_MFPL_PD6MFP_UART3_RTS},
    {PD_14, UART_5, SYS_GPD_MFPH_PD14MFP_UART5_RTS},
    {PF_8, UART_2, SYS_GPF_MFPH_PF8MFP_UART2_RTS},
    {PF_11, UART_1, SYS_GPF_MFPH_PF11MFP_UART1_RTS},
    {PF_15, UART_0, SYS_GPF_MFPH_PF15MFP_UART0_RTS},
    {PG_8, UART_4, SYS_GPG_MFPH_PG8MFP_UART4_RTS},
    {PH_13, UART_3, SYS_GPH_MFPH_PH13MFP_UART3_RTS},
    
    {NC,    NC,     0}
};

const PinMap PinMap_UART_CTS[] = {
    {PA_12, UART_0, SYS_GPA_MFPH_PA12MFP_UART0_CTS},
    {PB_5, UART_1, SYS_GPB_MFPL_PB5MFP_UART1_CTS},
    {PB_7, UART_4, SYS_GPB_MFPL_PB7MFP_UART4_CTS},
    {PB_8, UART_5, SYS_GPB_MFPH_PB8MFP_UART5_CTS},
    {PB_13, UART_4, SYS_GPB_MFPH_PB13MFP_UART4_CTS},
    {PC_3, UART_4, SYS_GPC_MFPL_PC3MFP_UART4_CTS},
    {PC_9, UART_2, SYS_GPC_MFPH_PC9MFP_UART2_CTS},
    {PD_7, UART_3, SYS_GPD_MFPL_PD7MFP_UART3_CTS},
    {PD_13, UART_5, SYS_GPD_MFPH_PD13MFP_UART5_CTS},
    {PF_12, UART_1, SYS_GPF_MFPH_PF12MFP_UART1_CTS},
    {PG_0, UART_0, SYS_GPG_MFPL_PG0MFP_UART0_CTS},
    {PG_9, UART_4, SYS_GPG_MFPH_PG9MFP_UART4_CTS},
    {PH_2, UART_2, SYS_GPH_MFPL_PH2MFP_UART2_CTS},
    {PH_14, UART_3, SYS_GPH_MFPH_PH14MFP_UART3_CTS},
    
    {NC,    NC,     0}
};

//*** SPI ***

const PinMap PinMap_SPI_MOSI[] = {
    {PA_10, SPI_3, SYS_GPA_MFPH_PA10MFP_SPI3_MOSI0},
    {PB_5, SPI_2, SYS_GPB_MFPL_PB5MFP_SPI2_MOSI0},
    {PC_7, SPI_0, SYS_GPC_MFPL_PC7MFP_SPI0_MOSI0},
    {PC_15, SPI_1, SYS_GPC_MFPH_PC15MFP_SPI1_MOSI0},
    {PE_3, SPI_0, SYS_GPE_MFPL_PE3MFP_SPI0_MOSI0},
    {PE_7, SPI_0, SYS_GPE_MFPL_PE7MFP_SPI0_MOSI0},
    {PF_0, SPI_1, SYS_GPF_MFPL_PF0MFP_SPI1_MOSI0},
    {PF_5, SPI_3, SYS_GPF_MFPL_PF5MFP_SPI3_MOSI0},
    {PG_8, SPI_2, SYS_GPG_MFPH_PG8MFP_SPI2_MOSI0},
    {PH_8, SPI_2, SYS_GPH_MFPH_PH8MFP_SPI2_MOSI0},
    {PI_6, SPI_3, SYS_GPI_MFPL_PI6MFP_SPI3_MOSI0},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_MISO[] = {
    {PA_2, SPI_3, SYS_GPA_MFPL_PA2MFP_SPI3_MISO0},
    {PA_9, SPI_3, SYS_GPA_MFPH_PA9MFP_SPI3_MISO0},
    {PB_4, SPI_2, SYS_GPB_MFPL_PB4MFP_SPI2_MISO0},
    {PC_6, SPI_0, SYS_GPC_MFPL_PC6MFP_SPI0_MISO0},
    {PD_0, SPI_1, SYS_GPD_MFPL_PD0MFP_SPI1_MISO0},
    {PD_15, SPI_1, SYS_GPD_MFPH_PD15MFP_SPI1_MISO0},
    {PE_2, SPI_0, SYS_GPE_MFPL_PE2MFP_SPI0_MISO0},
    {PE_6, SPI_0, SYS_GPE_MFPL_PE6MFP_SPI0_MISO0},
    {PF_4, SPI_3, SYS_GPF_MFPL_PF4MFP_SPI3_MISO0},
    {PG_7, SPI_2, SYS_GPG_MFPL_PG7MFP_SPI2_MISO0},
    {PH_7, SPI_2, SYS_GPH_MFPL_PH7MFP_SPI2_MISO0},
    {PI_5, SPI_3, SYS_GPI_MFPL_PI5MFP_SPI3_MISO0},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SCLK[] = {
    {PA_4, SPI_3, SYS_GPA_MFPL_PA4MFP_SPI3_CLK},
    {PA_8, SPI_3, SYS_GPA_MFPH_PA8MFP_SPI3_CLK},
    {PB_3, SPI_2, SYS_GPB_MFPL_PB3MFP_SPI2_CLK},
    {PC_8, SPI_0, SYS_GPC_MFPH_PC8MFP_SPI0_CLK},
    {PD_1, SPI_1, SYS_GPD_MFPL_PD1MFP_SPI1_CLK},
    {PD_14, SPI_1, SYS_GPD_MFPH_PD14MFP_SPI1_CLK},
    {PE_5, SPI_0, SYS_GPE_MFPL_PE5MFP_SPI0_CLK},
    {PF_3, SPI_3, SYS_GPF_MFPL_PF3MFP_SPI3_CLK},
    {PG_9, SPI_2, SYS_GPG_MFPH_PG9MFP_SPI2_CLK},
    {PH_6, SPI_2, SYS_GPH_MFPL_PH6MFP_SPI2_CLK},
    {PI_4, SPI_3, SYS_GPI_MFPL_PI4MFP_SPI3_CLK},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SPI_SSEL[] = {
    {PA_5, SPI_3, SYS_GPA_MFPL_PA5MFP_SPI3_SS0},
    {PA_7, SPI_3, SYS_GPA_MFPL_PA7MFP_SPI3_SS0},
    {PB_2, SPI_2, SYS_GPB_MFPL_PB2MFP_SPI2_SS0},
    {PC_2, SPI_0, SYS_GPC_MFPL_PC2MFP_SPI0_SS0},
    {PC_12, SPI_1, SYS_GPC_MFPH_PC12MFP_SPI1_SS0},
    {PD_13, SPI_1, SYS_GPD_MFPH_PD13MFP_SPI1_SS0},
    {PE_4, SPI_0, SYS_GPE_MFPL_PE4MFP_SPI0_SS0},
    {PF_2, SPI_3, SYS_GPF_MFPL_PF2MFP_SPI3_SS0},
    {PH_5, SPI_2, SYS_GPH_MFPL_PH5MFP_SPI2_SS0},
    {PI_3, SPI_3, SYS_GPI_MFPL_PI3MFP_SPI3_SS0},
    {PI_11, SPI_2, SYS_GPI_MFPH_PI11MFP_SPI2_SS0},
    
    {NC,    NC,    0}
};

//*** SD ***

const PinMap PinMap_SD_CD[] = {
    {PC_12, SD_0_1, SYS_GPC_MFPH_PC12MFP_SD1_CDn},
    {PD_3, SD_0_0, SYS_GPD_MFPL_PD3MFP_SD0_CDn},
    {PE_5, SD_0_0, SYS_GPE_MFPL_PE5MFP_SD0_CDn},
    {PF_6, SD_0_0, SYS_GPF_MFPL_PF6MFP_SD0_CDn},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SD_CMD[] = {
    {PC_13, SD_0_1, SYS_GPC_MFPH_PC13MFP_SD1_CMD},
    {PD_6, SD_0_0, SYS_GPD_MFPL_PD6MFP_SD0_CMD},
    {PE_6, SD_0_0, SYS_GPE_MFPL_PE6MFP_SD0_CMD},
    {PF_7, SD_0_0, SYS_GPF_MFPL_PF7MFP_SD0_CMD},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SD_CLK[] = {
    {PC_14, SD_0_1, SYS_GPC_MFPH_PC14MFP_SD1_CLK},
    {PD_7, SD_0_0, SYS_GPD_MFPL_PD7MFP_SD0_CLK},
    {PE_7, SD_0_0, SYS_GPE_MFPL_PE7MFP_SD0_CLK},
    {PF_8, SD_0_0, SYS_GPF_MFPH_PF8MFP_SD0_CLK},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT0[] = {
    {PC_9, SD_0_1, SYS_GPC_MFPH_PC9MFP_SD1_DAT0},
    {PD_2, SD_0_1, SYS_GPD_MFPL_PD2MFP_SD1_DAT0},
    {PE_11, SD_0_0, SYS_GPE_MFPH_PE11MFP_SD0_DAT0},
    {PF_5, SD_0_0, SYS_GPF_MFPL_PF5MFP_SD0_DAT0},
    
    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT1[] = {
    {PD_1, SD_0_1, SYS_GPD_MFPL_PD1MFP_SD1_DAT1},
    {PE_10, SD_0_0, SYS_GPE_MFPH_PE10MFP_SD0_DAT1},
    {PF_4, SD_0_0, SYS_GPF_MFPL_PF4MFP_SD0_DAT1},
    
    
    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT2[] = {
    {PD_0, SD_0_1, SYS_GPD_MFPL_PD0MFP_SD1_DAT2},
    {PE_9, SD_0_0, SYS_GPE_MFPH_PE9MFP_SD0_DAT2},
    {PF_3, SD_0_0, SYS_GPF_MFPL_PF3MFP_SD0_DAT2},

    {NC,    NC,    0}
};

const PinMap PinMap_SD_DAT3[] = {
    {PC_15, SD_0_1, SYS_GPC_MFPH_PC15MFP_SD1_DAT3},
    {PE_8, SD_0_0, SYS_GPE_MFPH_PE8MFP_SD0_DAT3},
    {PF_2, SD_0_0, SYS_GPF_MFPL_PF2MFP_SD0_DAT3},

    {NC,    NC,    0}
};

const PinMap PinMap_CAN_TD[] = {
    {PB_13, CAN_0, SYS_GPB_MFPH_PB13MFP_CAN0_TXD},
    {PA_1, CAN_1, SYS_GPA_MFPL_PA1MFP_CAN1_TXD},
    {PA_6, CAN_1, SYS_GPA_MFPL_PA6MFP_CAN1_TXD},
    {PH_1, CAN_1, SYS_GPH_MFPL_PH1MFP_CAN1_TXD},
        
    {NC,    NC,     0}
};


const PinMap PinMap_CAN_RD[] = {
    {PB_12, CAN_0, SYS_GPB_MFPH_PB12MFP_CAN0_RXD},
    {PA_0, CAN_1, SYS_GPA_MFPL_PA0MFP_CAN1_RXD},
    {PH_0, CAN_1, SYS_GPH_MFPL_PH0MFP_CAN1_RXD},
        
    {NC,    NC,    0}
};

